pdxagc/F103_handwheel_control/STM32/DCDEMO7/src/TFT.c
					case Net_Account_Manage_Page:                                       //画面11：网络账户管理
					{
						Work_Page_Status=Net_Account_Manage_Page;
						switch(get_control_id)
						{
							case Working_Page_button2: Work_Page_Status=Working_Page;break;
							case File_Manage_Button4: Work_Page_Status=File_Manage_Page;break;
							case Choose_WiFi_Button: Work_Page_Status=Choose_WiFi_Page;break;
							case Connect_WiFi_Button: 
							{
							  if(get_button_state)
								{
									WiFi_Password_Right++;								
								}
							
							}break;
							case Sign_In_Button:
							{
							  if(get_button_state)
								{
									Account_Password_Right++;								
								}
							
							}
							case Disconnect_WIFI_Button:break;
							case Sign_Out_Button:break;
							default:break;
						}
					}break;
					case Choose_WiFi_Page:                                                 //画面12：选择WiFi
   				{
						Work_Page_Status=Choose_WiFi_Page;
						switch(get_control_id)
						{
							case WiFi_1_Button: 
							{
							  Work_Page_Status=Net_Account_Manage_Page;
							}break;
							case WiFi_2_Button: 
							{
							  Work_Page_Status=Net_Account_Manage_Page;
							}break;
							case WiFi_3_Button: 
							{
							  Work_Page_Status=Net_Account_Manage_Page;
							}break;
							case WiFi_4_Button: 
							{
								Work_Page_Status=Net_Account_Manage_Page;
							}break;
							case WiFi_Next_Page_Button:
							{
							  if(get_button_state)
								{
								    WiFi_Page++;
								}
							}break;
							case WiFi_Last_Page_Button: 
							{
								if(get_button_state)
								{
									if(WiFi_Page>1)
								    WiFi_Page--;
								}
							}break;
							default:break;
						}
					}break;          
					case Disconnect_Remind_Page:                                            //画面15：断开网络提醒页面
					{
						switch(get_control_id)
						{
							case Sure_Button5:       //确定按钮触发
							{								
								Network_Control=4;
								Work_Page_Status=Net_Account_Manage_Page;
							}break;
							case Cancel_Button5:   //取消按钮触发
							{
								Work_Page_Status=Net_Account_Manage_Page;
							}break;
						}
					}break;     
					case SignOut_Remind_Page:                                                //画面16：退出登录提醒页面
					{
					  switch(get_control_id)
						{
							case Sure_Button6:        //确定按钮触发
							{
								Sign_Control=4;
							  Work_Page_Status=Net_Account_Manage_Page;
							}break;
							case Cancel_Button6:      //取消按钮触发
							{
								Work_Page_Status=Net_Account_Manage_Page;
							}break;
						}
					}	
					break;         
					case Cancel_Download_Page:                                                //取消下载提醒
					{
            switch(get_control_id)
						{
							case Sure_Button7:                                    //确定取消下载
							{
							  if(get_button_state)
								{
									Press_button = CMD_Cancel_Download;
                  Work_Page_Status=File_Manage_Page;									
								}
							}
							break;
							case Cancel_Button7: 
							{
							  if(get_button_state)
								{
									Press_button = 0xFF;
                  Work_Page_Status=File_Manage_Page;									
								}
							}
							break;
					  }
					}break;
					case Save_Pram_Page:                                                    //画面21 保存参数设置提醒页面
					{
						Work_Page_Status=Save_Pram_Page;
						if(state.Work_state==Stop)    //停止加工状态
						{
								switch(get_control_id)
								{
									case Sure_Button8:    //确定按钮触发
									{							
										pram_status.Save_Pram_Page_Sure_button=1;
										pram_status.Save_Pram_Page_concel_button=0;
									}break;
									case Cancel_Button8:   //取消按钮触发
									{
										pram_status.Save_Pram_Page_Sure_button=0;
										pram_status.Save_Pram_Page_concel_button=1;						
									}
									default: break;	
								}
					  }
					}break;
					default: break;						
  			}
        
     }
		 
}

/*! 
*  \brief  文本控件通知
*  \details  当文本通过键盘更新(或调用GetControlValue)时，执行此函数
*  \details  文本控件的内容以字符串形式下发到MCU，如果文本控件内容是浮点值，
*  \details  则需要在此函数中将下发字符串重新转回浮点值。
*  \param str 文本控件内容
*  \pram  value 存放文本内容
*/
float NotifyText(uint8 *str)
{                                                                          
		float value=0;                                                            
		sscanf((char *)str,"%f",&value);            
    return  value;                                                                      
}                                                                                



//主机工作状态显示
void Work_state_control(void)
{
  if(last_time_work_state!=state.Work_state)     //判断工作状态是否发生变化，发生变化则进行处理
	{
		if(state.Work_state==Start)         
		{
			Show_Start_Working(Work_Page_Status);      //TFT屏显示当前处于加工状态
		}
		else                                 
		{
			Show_Stop_Working(Work_Page_Status);        //TFT屏显示当前已经停止加工
		}
		last_time_work_state=state.Work_state;
	}

}

//显示机器已经停止加工
void Show_Stop_Working(uint8 state)
{
	if(state==0)
	  AnimationPlayFrame(0,11,0);
	else if(state==1)
	  AnimationPlayFrame(1,28,0);
	else if(state==2)
	  AnimationPlayFrame(2,43,0);
	else if(state==6)
	  AnimationPlayFrame(6,33,0);
	else if(state==10)
	  AnimationPlayFrame(10,5,0);
	else if(state==11)
	  AnimationPlayFrame(11,13,0);
}
//显示机器正在加工
void Show_Start_Working(uint8 state)
{
	if(state==0)
		AnimationPlayFrame(0,11,1);
	else if(state==1)
		AnimationPlayFrame(1,28,1);
	else if(state==2)
		AnimationPlayFrame(2,43,1);
	else if(state==6)
		AnimationPlayFrame(6,33,1);
	else if(state==10)
		AnimationPlayFrame(10,5,1);
	else if(state==11)
		AnimationPlayFrame(11,13,1);
	
}


//XYZAB坐标按钮复位
void XYZAB_button_reset(void)
{
	uint8 i;
	for(i=22;i<27;i++)
	{
		SetButtonValue(2,i,0);           
	}
}

//开机画面设置
void Power_On_Set(void)
{
	uint8 i=0;
	char buf[6];
	SetScreen(17);           //切换到开机画面
	delay_ms(500); 
		
	for(i=0;i<50;i++)
	{
		SetProgressValue(17,3,i*2);     //设置进度条的值
		delay_ms(5);                    //延时0.05秒
	}
	SetScreen(0);                    //切换到加工页面
	//SetTouchPaneOption(1,1,0,0);     //触摸屏设置
	delay_ms(10);
	
	SetTextValue(0,27,"G54");        //设置当前坐标值：G54
	SetTextValue(2,30,"G54");
	SetTextValue(0,28,"关");         //设置手轮引导“关”
	SetTextValue(2,31,"关");
	SetTextValue(0,29,"X10");         //设置倍率：X10
	SetTextValue(2,32,"X10");
	Multiple_num=10;                   //开机默认倍率
	
