pdxagc/F103_handwheel_control/STM32/DCDEMO7/src/TFT.c
	Speed.Initial_Spindle_Speed=20000;                     //主轴初始转速
	Speed.Initial_Spindle_Speed_Percent=100;               //主轴初始速度百分比
	Speed.Initial_Work_Speed=1000;                         //加工初始速度
	Speed.Initial_Work_Speed_Percent=100;                  //加工初始速度百分比
	Speed.Changed_Spindle_Speed=20000;                     //变化后的主轴转速              
	Speed.Changed_Work_Speed=1000;                         //变化后的加工速度
	
	SetProgressValue(0,1,Speed.Initial_Spindle_Speed_Percent);  //主轴速度进度条初始化：100%
	sprintf(buf,"%d",Speed.Initial_Spindle_Speed);
	SetTextValue(0,24,(uchar *)buf);                            //主轴速度文本框初始化：20000
	

	SetProgressValue(0,2,Speed.Initial_Work_Speed_Percent);	     //加工速度进度条初始化：100%
	sprintf(buf,"%d",Speed.Initial_Work_Speed_Percent);
	SetTextValue(0,39,(uchar *)buf);                             //加工速度进度条初始化：100%	      
	sprintf(buf,"%d",Speed.Initial_Work_Speed);
	SetTextValue(0,25,(uchar *)buf);                             //加工速度文本框初始化：100%
	   
	
	SetButtonValue(2,13,0);          //开始按钮是松开状态
	SetButtonValue(2,14,1);          //停止按钮是按下状态
	
	Work_Page_Status=Working_Page;    //开机进入加工页面
	
	control_panel_pram.Axis_press = CMD_X_AXIS;
	SetButtonValue(0,42,1);           //X轴选中状态
	SetButtonValue(2,22,1);
	
	
	//SetPowerSaving(1,200,50,30);  // 自动调节背光亮度


}



//加工中心主轴速度和加工速度按钮处理
void Spindle_and_Work_Speed_Key_Process(void)
{
	char buf[10];
  if(Speed.Spindle_Speed_Changed==Changed)
	{
		Speed.Spindle_Speed_Changed=Unchanged;
		sprintf(buf,"%d",Speed.Changed_Spindle_Speed);
		SetTextValue(0,24,(uchar *)buf);                                 //修改主轴速度文本框数值		               
		SetProgressValue(0,1,Speed.Initial_Spindle_Speed_Percent);       //修改主轴速度进度条数值
		
	}
	if(Speed.Work_Speed_Changed==Changed)
	{
		Speed.Work_Speed_Changed=Unchanged;
		sprintf(buf,"%d",Speed.Changed_Work_Speed);
		SetTextValue(0,25,(uchar *)buf);                                   //修改加工速度文本框数值
		SetProgressValue(0,2,Speed.Initial_Work_Speed_Percent);            //修改加工速度进度条数值	
		sprintf(buf,"%d",Speed.Initial_Work_Speed_Percent);
		SetTextValue(0,39,(uchar *)buf);  
		
	}
}

//设置页面语音提示按钮触发后处理程序
void Speaker_Key_Process(uint8  state)
{
	if(state==voice_off)        //喇叭音量调到0；EE 93 00 FF FC FF FF
	{
		 SpeakerControl(0);
		 SetButtonValue(1,27,1);
		 pram_status.Voice_last_status=voice_off;
	}
	else                        //喇叭音量调到最大：EE 93 64 FF FC FF FF 
	{
		 SpeakerControl(100);
		 SetButtonValue(1,27,0);
     pram_status.Voice_last_status=voice_on;	
	}
	AT24CXX_WriteOneByte(0,pram_status.Voice_last_status);
//	FLASH_WriteByte(START_ADDR1,(uint16)pram_status.Voice_last_status);
}



//设置页面安全Z按钮触发后处理程序
void Safe_Z_process(uint8 state)
{
	if(state)                  //模式2（按钮按下状态）
	{
		SetButtonValue(1,1,1);
	  pram_status.Safe_Z_last_status=1;
//		Usart_SendString(USART2,"Safe_z:mode2"); 
	}
	else
	{
		SetButtonValue(1,1,0);      //模式1
	  pram_status.Safe_Z_last_status=0;
//		Usart_SendString(USART2,"Safe_z:mode1"); 
	}
	AT24CXX_WriteOneByte(1,pram_status.Safe_Z_last_status);
//	FLASH_WriteByte(START_ADDR2,(uint16)pram_status.Safe_Z_last_status);
}



//设置页面自动对刀按钮触发后处理程序
void Auto_Knife_process(uint8 state)
{
  if(state)                  //模式2（按钮按下状态）
	{
		SetButtonValue(1,2,1);
	  pram_status.Auto_Knife_last_status=1;
//		Usart_SendString(USART2,"Auto_Knife:mode2");
	}
	else
	{
		SetButtonValue(1,2,0);      //模式1
	  pram_status.Auto_Knife_last_status=0;
//		Usart_SendString(USART2,"Auto_Knife:mode2");
	}
	AT24CXX_WriteOneByte(2,pram_status.Auto_Knife_last_status);
//	FLASH_WriteByte(START_ADDR3,(uint16)pram_status.Auto_Knife_last_status);
}
//设置页面单位切换按钮触发后处理程序
void Unit_Change_process(uint8 state)
{
	if(state )                  //模式2（按钮按下状态:英制）
	{
		SetButtonValue(1,3,1);
	  pram_status.Unit_Change_last_status=1;
//		Usart_SendString(USART2,"Unit:mode2");
	}
	else
	{
		SetButtonValue(1,3,0);      //模式1
	  pram_status.Unit_Change_last_status=0;
//		Usart_SendString(USART2,"Unit:mode1");
	}
	AT24CXX_WriteOneByte(3,pram_status.Unit_Change_last_status);
//  FLASH_WriteByte(START_ADDR4,(uint16)pram_status.Unit_Change_last_status);

}

//恢复上一次设置状态
void Return_last_status(void)
{
  Speaker_Key_Process(pram_status.Voice_last_status);	        //设置页面语音提示按钮状态处理程序
	Safe_Z_process(pram_status.Safe_Z_last_status);             //设置页面安全Z按钮触发后处理程序
	Auto_Knife_process(pram_status.Auto_Knife_last_status);     //设置页面自动对刀按钮触发后处理程序
	Unit_Change_process(pram_status.Unit_Change_last_status);   //设置页面单位切换按钮触发后处理程序
}

//保存当前设置
void Save_Set(void)
{
  Speaker_Key_Process(pram_status.voice_button_status);     //语音提示按钮处理函数
	Safe_Z_process(pram_status.Safe_Z_button_satus);           //安全Z触发处理函数
	Auto_Knife_process(pram_status.Auto_Knife_button_status);  //自动对刀按钮触发后处理程序
	Unit_Change_process(pram_status.Unit_Change_button_status); //单位切换按钮触发后处理程序

}

//获取设置页面几个参数值（断电保存在flash）
void Get_Setting_page_pram(void)
{
	pram_status.Voice_last_status=AT24CXX_ReadOneByte(0);
	pram_status.voice_button_status=pram_status.Voice_last_status;            //设置语音提醒模式
	
	pram_status.Safe_Z_last_status=AT24CXX_ReadOneByte(1);
	pram_status.Safe_Z_button_satus=pram_status.Safe_Z_last_status;           //设置安全Z模式
	
	pram_status.Auto_Knife_last_status=AT24CXX_ReadOneByte(2);
	pram_status.Auto_Knife_button_status=pram_status.Auto_Knife_last_status;  //设置自动对刀模式
	
	pram_status.Unit_Change_last_status=AT24CXX_ReadOneByte(3);
	pram_status.Unit_Change_button_status=pram_status.Unit_Change_last_status; //设置单位模式
}
//坐标切换控制
void Coordinate_Change_Process(void)
{
	Coordinate_Change_Counter++;
	switch(Coordinate_Change_Counter)
	{
		case 1:
		{
			SetTextValue(0,27,"G55");        //设置文本值
			SetTextValue(2,30,"G55");       
			break;  
		}
		case 2:
		{
			SetTextValue(0,27,"G56");
			SetTextValue(2,30,"G56");
			break;
		}
		case 3:
		{
			SetTextValue(0,27,"G57");
			SetTextValue(2,30,"G57");
			break;
		}
		case 4:
		{
			SetTextValue(0,27,"G58");
			SetTextValue(2,30,"G58");
			break;
		}
		case 5:
		{
			SetTextValue(0,27,"G59");
			SetTextValue(2,30,"G59");
			break;
		}
		case 6:
		{
			SetTextValue(0,27,"G54");
			SetTextValue(2,30,"G54");
			Coordinate_Change_Counter=0;
			break;
		}	
	}
}
//控制面板倍率控制
void Multiple_Change_Process(void)
{
	Multiple_Change_Counter++;	
	switch(Multiple_Change_Counter)
	{
		case 1:
		{
			SetTextValue(0,29,"X10");    //设置文本值
			SetTextValue(2,32,"X10");
			Multiple_num=10;
			break;  
		}
		case 2:
		{
			SetTextValue(0,29,"X20");                                                                                                                                 
			SetTextValue(2,32,"X20");
			Multiple_num=20;
			break;
		}
		case 3:
		{
			SetTextValue(0,29,"X1");
			SetTextValue(2,32,"X1");
			Multiple_num=1;
			break;
		}
		case 4:
		{
			SetTextValue(0,29,"X2");
			SetTextValue(2,32,"X2");
			Multiple_num=2;
			break;
		}
		case 5:
		{
			SetTextValue(0,29,"X5");
			SetTextValue(2,32,"X5");
			Multiple_num=5;
			Multiple_Change_Counter=0;
			break;
		}	
    default:break;		
	}	
  
