pdxagc/F103_handwheel_control/STM32/DCDEMO7/src/TFT.c
}

// 在加工页面和控制面板页面显示所有轴坐标
void TFT_Show_coordanate_value(void)
{
		
		Show_X_Coordinata();
		Show_Y_Coordinata();
		Show_Z_Coordinata();
		Show_A_Coordinata();
		Show_B_Coordinata();			

//	sprintf((char *)buf1,"%09.2f",control_panel_pram.X_Mac_value); 
//	SetTextValue(2,38,(uchar *)buf1);	                               //显示X轴机械坐标
//	SetTextValue(0,34,(uchar *)buf1);

//	
//	sprintf((char *)buf1,"%09.2f",control_panel_pram.Y_Mac_value);
//	SetTextValue(2,39,(uchar *)buf1);                                //显示Y轴机械坐标
//	SetTextValue(0,35,(uchar *)buf1);
//	
//	sprintf((char *)buf1,"%09.2f",control_panel_pram.Z_Mac_value);
//	SetTextValue(2,40,(uchar *)buf1);                                //显示Z轴机械坐标
//	SetTextValue(0,36,(uchar *)buf1);
//	
//	sprintf((char *)buf1,"%09.2f",control_panel_pram.A_Mac_value);
//	SetTextValue(2,41,(uchar *)buf1);                                //显示A轴机械坐标
//	SetTextValue(0,37,(uchar *)buf1);
//	
//	sprintf((char *)buf1,"%09.2f",control_panel_pram.B_Mac_value);
//	SetTextValue(2,42,(uchar *)buf1);                               //显示B轴机械坐标
//	SetTextValue(0,38,(uchar *)buf1);

}

//显示回工件零页面所有轴坐标值
void Show_coordinate_on_return_workpiece_zero_page(void)
{
	char buf[20];
  sprintf((char *)buf,"%09.2f",control_panel_pram.X_value);
	SetTextValue(3,9,(uchar *)buf);	          //在手轮上显示X轴工件坐标
	
	sprintf((char *)buf,"%09.2f",control_panel_pram.Y_value);
	SetTextValue(3,10,(uchar *)buf);	        //在手轮上显示Y轴工件坐标     	
	
	sprintf((char *)buf,"%09.2f",control_panel_pram.Z_value);
	SetTextValue(3,11,(uchar *)buf);	       //在手轮上显示Z轴工件坐标
	
	
	sprintf((char *)buf,"%09.2f",control_panel_pram.A_value);
	SetTextValue(3,12,(uchar *)buf);	       //在手轮上显示A轴工件坐标
		
	
	sprintf((char *)buf,"%09.2f",control_panel_pram.B_value);
	SetTextValue(3,13,(uchar *)buf);	        //在手轮上显示B轴工件坐标
}


//显示X轴坐标
void Show_X_Coordinata(void)
{	
	char buf1[20];
	if(control_panel_pram.X_last_value!=control_panel_pram.X_value)
	{
		sprintf((char *)buf1,"%09.2f",control_panel_pram.X_value);      //显示X轴工件坐标		
		SetTextValue(0,16,(uchar *)buf1);
		SetTextValue(2,17,(uchar *)buf1);
		control_panel_pram.X_last_value=control_panel_pram.X_value;
	}
}


//显示Y轴坐标
void Show_Y_Coordinata(void)
{
	char buf1[20];
	if(control_panel_pram.Y_last_value!=control_panel_pram.Y_value)
	{
		sprintf((char *)buf1,"%09.2f",control_panel_pram.Y_value);       //显示Y轴工件坐标
		SetTextValue(0,17,(uchar *)buf1);
		SetTextValue(2,18,(uchar *)buf1);
		control_panel_pram.Y_last_value=control_panel_pram.Y_value;
	}
}

//显示Z轴坐标
void Show_Z_Coordinata(void)
{
	char buf1[20];
	if(control_panel_pram.Z_last_value!=control_panel_pram.Z_value)
	{
		sprintf((char *)buf1,"%09.2f",control_panel_pram.Z_value);      //显示Z轴工件坐标
		SetTextValue(0,18,(uchar *)buf1);
		SetTextValue(2,19,(uchar *)buf1);
		control_panel_pram.Z_last_value=control_panel_pram.Z_value;
	}
}

//显示A轴坐标
void Show_A_Coordinata(void)
{
	char buf1[20];
	if(control_panel_pram.A_last_value!=control_panel_pram.A_value)
	{
		sprintf((char *)buf1,"%09.2f",control_panel_pram.A_value);       //显示A轴工件坐标
		SetTextValue(0,19,(uchar *)buf1);
		SetTextValue(2,20,(uchar *)buf1);
		control_panel_pram.A_last_value=control_panel_pram.A_value;		
	}
}

//显示B轴坐标
void Show_B_Coordinata(void)
{
	char buf1[20];
	if(control_panel_pram.B_last_value!=control_panel_pram.B_value)
	{
		sprintf((char *)buf1,"%09.2f",control_panel_pram.B_value);        //显示B轴工件坐标
		SetTextValue(0,20,(uchar *)buf1);
		SetTextValue(2,21,(uchar *)buf1);
		control_panel_pram.B_last_value=control_panel_pram.B_value;
	}
}

//显示X轴选中状态
void Show_X_Axis_State(void)
{
  SetButtonValue(0,42,1);           //X轴选中状态
	SetButtonValue(0,43,0);
	SetButtonValue(0,44,0);
	SetButtonValue(0,45,0);
	SetButtonValue(0,46,0);
	
  SetButtonValue(2,22,1);
	SetButtonValue(2,23,0);
	SetButtonValue(2,24,0);
	SetButtonValue(2,25,0);
	SetButtonValue(2,26,0);
}

//显示Y轴选中状态
void Show_Y_Axis_State(void)
{
  SetButtonValue(0,42,0);           //Y轴选中状态
	SetButtonValue(0,43,1);
	SetButtonValue(0,44,0);
	SetButtonValue(0,45,0);
	SetButtonValue(0,46,0);
	
  SetButtonValue(2,22,0);
	SetButtonValue(2,23,1);
	SetButtonValue(2,24,0);
	SetButtonValue(2,25,0);
	SetButtonValue(2,26,0);
}

//显示Z轴选中状态
void Show_Z_Axis_State(void)
{
  SetButtonValue(0,42,0);           //Z轴选中状态
	SetButtonValue(0,43,0);
	SetButtonValue(0,44,1);
	SetButtonValue(0,45,0);
	SetButtonValue(0,46,0);
	
  SetButtonValue(2,22,0);
	SetButtonValue(2,23,0);
	SetButtonValue(2,24,1);
	SetButtonValue(2,25,0);
	SetButtonValue(2,26,0);
}

//显示A轴选中状态
void Show_A_Axis_State(void)
{
  SetButtonValue(0,42,0);           //A轴选中状态
	SetButtonValue(0,43,0);
	SetButtonValue(0,44,0);
	SetButtonValue(0,45,1);
	SetButtonValue(0,46,0);
	
  SetButtonValue(2,22,0);
	SetButtonValue(2,23,0);
	SetButtonValue(2,24,0);
	SetButtonValue(2,25,1);
	SetButtonValue(2,26,0);
}

//显示B轴选中状态
void Show_B_Axis_State(void)
{
  SetButtonValue(0,42,0);           //B轴选中状态
	SetButtonValue(0,43,0);
	SetButtonValue(0,44,0);
	SetButtonValue(0,45,0);
	SetButtonValue(0,46,1);
	
  SetButtonValue(2,22,0);
	SetButtonValue(2,23,0);
	SetButtonValue(2,24,0);
	SetButtonValue(2,25,0);
	SetButtonValue(2,26,1);
}
